//1. Добавьте пустые классы для корзины товаров и 
//элемента корзины товаров. Продумайте, какие методы понадобятся для работы с этими сущностями.

class BasketList {
    constructor() {

    }
    // метод для очистки корзины
    clearAll() {

    }

    //метод добавления корзины в Local Storage
    basketToLS () {

    }

    //метод проверки корзины 
    checkBasketInLS () {

    }
    
    //метод подсчета суммы купленных товаров
    totalSum(){

    }
    //метод оплаты товаров
    pay(){

    }
}

class BasketItem {
    constructor() {

    }
    //увеличить количество элемента товара на один
    plusItem () {

    }

    //уменьшить количество элемента товара на один
    minusItem (){

    }

    //удалить элемент товара из корзины
    deleteItem () {

    }


} 

